{
  "irVersion": "1.0",
  "project": "mogo",
  "repository": "https://github.com/grokify/mogo",
  "versioning": "semver",
  "commitConvention": "conventional",
  "releases": [
    {
      "version": "v0.74.2",
      "date": "2026-04-20",
      "added": [
        { "description": "`path/filepathutil`: add `NormalizePath()` for cross-platform path comparison", "commit": "2ae676a" }
      ],
      "fixed": [
        { "description": "`path/filepathutil`: fix variable shadowing in `ChangeStripExtension()` (filepath -> fp)", "commit": "2ae676a" }
      ]
    },
    {
      "version": "v0.74.1",
      "date": "2026-04-04",
      "added": [
        { "description": "`os/osutil`: add `ReadDirFilesSecure()` for symlink-safe directory reading using `os.Root` (G122)", "commit": "6d4689b" },
        { "description": "`os/osutil`: add `WriteFileSecure()`, `CopyFileSecure()` for path-traversal-safe operations (G703)", "commit": "6d4689b" },
        { "description": "`os/osutil`: add `ValidateNoTraversal()`, `CleanPathSecure()`, `AbsPathSecure()` path validation", "commit": "6d4689b" },
        { "description": "`lintfix/gosec`: add `NolintG122()` for filepath.Walk TOCTOU race conditions", "commit": "3a6d415" }
      ],
      "changed": [
        { "description": "`lintfix/gosec`: update G703 guidance to recommend secure functions for pkg/ code", "commit": "3a6d415" },
        { "description": "`lintfix`: add G122 to remediations.json with `os.Root` and `osutil.ReadDirFilesSecure` recommendations", "commit": "3a6d415" }
      ]
    },
    {
      "version": "v0.74.0",
      "date": "2026-03-16",
      "highlights": [
        { "description": "New `lintfix` package providing lint remediation database and nolint generators for gosec rules" }
      ],
      "breaking": [
        { "description": "`os/osutil`: `WriteFileReader()` signature changed from `(filename, r)` to `(filename, r, perm)` for explicit permission control", "commit": "282752d" }
      ],
      "added": [
        { "description": "`lintfix`: add lint remediation database with embedded JSON and query API", "commit": "3dd6bbb" },
        { "description": "`lintfix/gosec`: add nolint comment generators for G101, G115, G117, G118, G703, G704", "commit": "3dd6bbb" },
        { "description": "`lintfix/gosec`: add `CommonReasons` constants for frequently used justifications", "commit": "3dd6bbb" },
        { "description": "`text/markdown`: add `Children` field to `Link` for hierarchical link structures", "commit": "4f3408d" }
      ],
      "changed": [
        { "description": "`os/osutil`: simplify `WriteFileReader()` using `io.Copy` instead of buffered writer", "commit": "282752d" },
        { "description": "`os/osutil`: remove panic on `Close()` error in `WriteFileReader()`", "commit": "282752d" }
      ],
      "documentation": [
        { "description": "add `docs/lintfix/` with gosec version caveats and remediation decision tree", "commit": "3dd6bbb" },
        { "description": "`README.md`: update internal style", "commit": "dc27ab4" },
        { "description": "add `CHANGELOG.json` and generate `CHANGELOG.md`", "commit": "f4b3df3" }
      ],
      "fixed": [
        { "description": "add `https://` prefix to repository URL in `CHANGELOG.json`", "commit": "03d5dda" },
        { "description": "fix `gofmt` lint error", "commit": "19b604d" }
      ]
    },
    {
      "version": "v0.73.5",
      "date": "2026-03-14",
      "added": [
        {
          "description": "`net/http/httputilmore`: add `Cookies{}`",
          "commit": "b7ea20e"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #219 from grokify/dependabot/go_modules/golang.org/x/image-0.37.0",
          "issue": "219",
          "commit": "557e235"
        },
        {
          "description": "Merge pull request #220 from grokify/dependabot/go_modules/golang.org/x/net-0.52.0",
          "issue": "220",
          "commit": "7466681"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/image from 0.36.0 to 0.37.0",
          "commit": "36fa44a"
        },
        {
          "description": "bump golang.org/x/net from 0.51.0 to 0.52.0",
          "commit": "e5c030f"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update dependencies",
          "commit": "c0e0ce7"
        }
      ]
    },
    {
      "version": "v0.73.4",
      "date": "2026-03-07",
      "added": [
        {
          "description": "add request body limiting utilities for G120 remediation",
          "commit": "f525d04"
        }
      ],
      "fixed": [
        {
          "description": "inline MaxBytesReader in ParseFormLimited for G120 visibility",
          "commit": "f643416"
        }
      ]
    },
    {
      "version": "v0.73.3",
      "date": "2026-03-01",
      "added": [
        {
          "description": "add log injection prevention utilities",
          "commit": "6a02c0f"
        }
      ],
      "fixed": [
        {
          "description": "resolve gosec lint warnings with nolint annotations",
          "commit": "7c6ea1f"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #214 from grokify/dependabot/go_modules/github.com/caarlos0/env/v11-11.4.0",
          "issue": "214",
          "commit": "b525681"
        },
        {
          "description": "Merge pull request #215 from grokify/dependabot/go_modules/golang.org/x/net-0.51.0",
          "issue": "215",
          "commit": "f047a64"
        }
      ],
      "documentation": [
        {
          "description": "`README.md`: update shields",
          "commit": "2ed3617"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/net from 0.50.0 to 0.51.0",
          "commit": "4b890e3"
        },
        {
          "description": "bump github.com/caarlos0/env/v11 from 11.3.1 to 11.4.0",
          "commit": "2d6fa7a"
        }
      ],
      "infrastructure": [
        {
          "description": "migrate to reusable workflows from grokify/.github",
          "commit": "4213016"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update dependencies",
          "commit": "ee96014"
        }
      ]
    },
    {
      "version": "v0.73.2",
      "date": "2026-02-14",
      "added": [
        {
          "description": "add SanitizePath for safe subprocess path handling",
          "commit": "3d8b1bc"
        }
      ]
    },
    {
      "version": "v0.73.1",
      "date": "2026-02-14",
      "dependencies": [
        {
          "description": "Merge pull request #210 from grokify/dependabot/go_modules/golang.org/x/image-0.36.0",
          "issue": "210",
          "commit": "ad859f8"
        },
        {
          "description": "Merge pull request #209 from grokify/dependabot/go_modules/golang.org/x/text-0.34.0",
          "issue": "209",
          "commit": "87fa5e1"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/image from 0.35.0 to 0.36.0",
          "commit": "40a0324"
        },
        {
          "description": "bump golang.org/x/text from 0.33.0 to 0.34.0",
          "commit": "c89d603"
        }
      ],
      "internal": [
        {
          "description": "sast: update go versions",
          "commit": "b0243da"
        },
        {
          "description": "`go mod`: update go versions",
          "commit": "7909820"
        },
        {
          "description": "`go mod`: update go versions",
          "commit": "e2e99e7"
        },
        {
          "description": "`go mod`: update dependencies",
          "commit": "0e51dcd"
        }
      ]
    },
    {
      "version": "v0.73.0",
      "date": "2026-02-07",
      "added": [
        {
          "description": "add terminal progress bar rendering",
          "commit": "a5f9256"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update dependencies",
          "commit": "13d6b83"
        }
      ]
    },
    {
      "version": "v0.72.7",
      "date": "2026-01-30",
      "dependencies": [
        {
          "description": "Merge pull request #206 from grokify/dependabot/go_modules/golang.org/x/net-0.49.0",
          "issue": "206",
          "commit": "72f4c4c"
        },
        {
          "description": "Merge pull request #208 from grokify/dependabot/go_modules/golang.org/x/crypto-0.47.0",
          "issue": "208",
          "commit": "e24e343"
        },
        {
          "description": "Merge pull request #207 from grokify/dependabot/go_modules/golang.org/x/image-0.35.0",
          "issue": "207",
          "commit": "1651a9b"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/crypto from 0.46.0 to 0.47.0",
          "commit": "3c79647"
        },
        {
          "description": "bump golang.org/x/net from 0.48.0 to 0.49.0",
          "commit": "ed30eaf"
        },
        {
          "description": "bump golang.org/x/image from 0.34.0 to 0.35.0",
          "commit": "2f998a4"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update dependencies",
          "commit": "9b324d8"
        }
      ]
    },
    {
      "version": "v0.72.6",
      "date": "2026-01-12",
      "added": [
        {
          "description": "`testing/coverbadge`: add `cmd/gocoverbadge`",
          "commit": "7c6945d"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #204 from grokify/dependabot/go_modules/golang.org/x/term-0.39.0",
          "issue": "204",
          "commit": "f48aab6"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/term from 0.38.0 to 0.39.0",
          "commit": "164d9ac"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "de9e49c"
        }
      ]
    },
    {
      "version": "v0.72.5",
      "date": "2025-12-21",
      "added": [
        {
          "description": "`log/slogutil`: add `ContextWithLogger()`, `LoggerFromContext()`",
          "commit": "adb3527"
        }
      ],
      "changed": [
        {
          "description": "`log/slogutil`: add `nil` check",
          "commit": "4021a22"
        }
      ]
    },
    {
      "version": "v0.72.4",
      "date": "2025-12-20",
      "added": [
        {
          "description": "`net/http/retryhttp`: add",
          "commit": "e36b882"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "9717147"
        }
      ]
    },
    {
      "version": "v0.72.3",
      "date": "2025-12-12",
      "dependencies": [
        {
          "description": "Merge pull request #202 from grokify/dependabot/go_modules/golang.org/x/image-0.34.0",
          "issue": "202",
          "commit": "dab8c50"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/image from 0.33.0 to 0.34.0",
          "commit": "4a177f4"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "875eb02"
        }
      ]
    },
    {
      "version": "v0.72.2",
      "date": "2025-12-07",
      "added": [
        {
          "description": "`sort/sortutil`: add `IntegerSuffix()`",
          "commit": "56e5162"
        }
      ]
    },
    {
      "version": "v0.72.1",
      "date": "2025-12-05",
      "added": [
        {
          "description": "`log/slogutil`: add `Discard()`, `Null()`",
          "commit": "b4bb0e4"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "d3bc07b"
        }
      ]
    },
    {
      "version": "v0.72.0",
      "date": "2025-11-30",
      "added": [
        {
          "description": "`crypto/token`: add `Base32()`, `Base58()`, `Base64()`, `Bytes()`, `Hex()`, `String()`",
          "commit": "56d3e84"
        },
        {
          "description": "`archive`: add `archivesecure`, `ziputil`; add to `tarutil`",
          "commit": "b967c24"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update to `github.com/btcsuite/btcd/btcutil/base58`",
          "commit": "b654225"
        },
        {
          "description": "`go mod`: update",
          "commit": "c045ec5"
        },
        {
          "description": "`codeql`: fix findings",
          "commit": "e2eec27"
        },
        {
          "description": "`golangci-lint`: fix unzip security issues",
          "commit": "4ece01b"
        },
        {
          "description": "`golangci-lint`: fix error handling",
          "commit": "6413042"
        }
      ]
    },
    {
      "version": "v0.71.10",
      "date": "2025-11-22",
      "added": [
        {
          "description": "`text/markdown`: add `GeneratedAt` prefix functions for markdown times",
          "commit": "7402e40"
        }
      ],
      "changed": [
        {
          "description": "`pointer`: move func names to alphabetical order",
          "commit": "7632a8c"
        },
        {
          "description": "`time/timeutil`: update layout `HumanDateTime`",
          "commit": "ab2869f"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #198 from grokify/dependabot/github_actions/actions/checkout-6",
          "issue": "198",
          "commit": "191cc90"
        },
        {
          "description": "Merge pull request #197 from grokify/dependabot/go_modules/golang.org/x/crypto-0.45.0",
          "issue": "197",
          "commit": "911c88a"
        }
      ],
      "build": [
        {
          "description": "bump actions/checkout from 5 to 6",
          "commit": "4484b6e"
        },
        {
          "description": "bump golang.org/x/crypto from 0.44.0 to 0.45.0",
          "commit": "84575bc"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "e10c7a5"
        }
      ]
    },
    {
      "version": "v0.71.9",
      "date": "2025-11-11",
      "added": [
        {
          "description": "`strconv/strconvutil`: add `ParseInts()`",
          "commit": "5744bc7"
        },
        {
          "description": "`time/timeutil`: add `HumanDateTime`",
          "commit": "7602640"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #192 from grokify/dependabot/go_modules/golang.org/x/crypto-0.44.0",
          "issue": "192",
          "commit": "e516317"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/crypto from 0.43.0 to 0.44.0",
          "commit": "23832f7"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "396a9f6"
        }
      ]
    },
    {
      "version": "v0.71.8",
      "date": "2025-11-10",
      "added": [
        {
          "description": "`time/duration`: add constants",
          "commit": "c068dca"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #191 from grokify/dependabot/github_actions/golangci/golangci-lint-action-9",
          "issue": "191",
          "commit": "0316534"
        }
      ],
      "build": [
        {
          "description": "bump golangci/golangci-lint-action from 8 to 9",
          "commit": "59ba78f"
        }
      ],
      "internal": [
        {
          "description": "`golangci-lint`: fix various",
          "commit": "ffe6505"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "d9785c6"
        },
        {
          "description": "`golangci-lint`: add length check",
          "commit": "ae5c3c6"
        },
        {
          "description": "`golangci-lint`: add length check",
          "commit": "6b671b8"
        },
        {
          "description": "`golangci-lint`: remove deprecated `// +build` directives",
          "commit": "cac324a"
        },
        {
          "description": "`go mod`: update",
          "commit": "88a7ed6"
        }
      ]
    },
    {
      "version": "v0.71.7",
      "date": "2025-10-26",
      "added": [
        {
          "description": "`cmp/cmputil`: add `Compare`, `Operator`",
          "commit": "7eb0eb7"
        }
      ]
    },
    {
      "version": "v0.71.6",
      "date": "2025-10-26",
      "changed": [
        {
          "description": "`time/duration`: update `Unit`",
          "commit": "e53cf46"
        }
      ]
    },
    {
      "version": "v0.71.5",
      "date": "2025-10-25",
      "added": [
        {
          "description": "feat `time/duration`: add `Spec{}`",
          "commit": "b7f5e08"
        }
      ],
      "changed": [
        {
          "description": "`time/duration`: add YAML tags",
          "commit": "0e33853"
        },
        {
          "description": "`time/duration`: add JSON tags",
          "commit": "436fee4"
        },
        {
          "description": "`time/duration`: move duration code from `time/timeutil`",
          "commit": "002a42d"
        }
      ]
    },
    {
      "version": "v0.71.4",
      "date": "2025-10-25",
      "added": [
        {
          "description": "`type/stringsutil`: add `HasPrefixAny()`",
          "commit": "4059729"
        }
      ],
      "changed": [
        {
          "description": "`type/stringsutil`: move code",
          "commit": "9f70c27"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "9e853da"
        }
      ]
    },
    {
      "version": "v0.71.3",
      "date": "2025-10-12",
      "changed": [
        {
          "description": "`text/markdown`: update to full width separator line",
          "commit": "9855e45"
        },
        {
          "description": "`text/markdown`: update to full width separator line",
          "commit": "42ed8b1"
        }
      ],
      "internal": [
        {
          "description": "`text/markdown`: streamline code",
          "commit": "cbc1306"
        },
        {
          "description": "`text/markdown`: streamline code",
          "commit": "8a4c0b0"
        }
      ]
    },
    {
      "version": "v0.71.2",
      "date": "2025-10-12",
      "added": [
        {
          "description": "`image/imageutil`: add `CreateIsPaddingFuncMagicWand()`",
          "commit": "7c44c42"
        },
        {
          "description": "`image/colors`: add `MagicWandMatch()`",
          "commit": "a690ae9"
        }
      ],
      "fixed": [
        {
          "description": "`image/padding`: remove unused code",
          "commit": "caa1e75"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #185 from grokify/dependabot/github_actions/github/codeql-action-4",
          "issue": "185",
          "commit": "42d3bf9"
        }
      ],
      "documentation": [
        {
          "description": "`image/padding`: add function description",
          "commit": "746cbaf"
        }
      ],
      "build": [
        {
          "description": "bump github/codeql-action from 3 to 4",
          "commit": "7dc8a00"
        }
      ],
      "internal": [
        {
          "description": "`image/padding`: fix conversion",
          "commit": "6a81c0f"
        },
        {
          "description": "`go mod`: update",
          "commit": "95932a7"
        },
        {
          "description": "`go mod`: update",
          "commit": "a1b8460"
        }
      ]
    },
    {
      "version": "v0.71.1",
      "date": "2025-09-29",
      "changed": [
        {
          "description": "`text/markdown`: update `TableRowsToMarkdown()` to auto-align columns",
          "commit": "56d22f4"
        }
      ]
    },
    {
      "version": "v0.71.0",
      "date": "2025-09-28",
      "added": [
        {
          "description": "`crypto`: add `Crypter{}` interface",
          "commit": "def409f"
        },
        {
          "description": "`crypto/aesutil/aesopenssl`: add",
          "commit": "afd6a46"
        },
        {
          "description": "`crypto/aesutil/aesargon`: add",
          "commit": "2e9f1fd"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "ba95563"
        },
        {
          "description": "`golangci-lint`: add false postiive override",
          "commit": "4f22f79"
        },
        {
          "description": "`go mod`: update",
          "commit": "b0aafe2"
        }
      ]
    },
    {
      "version": "v0.70.23",
      "date": "2025-09-14",
      "added": [
        {
          "description": "`type/maputil`: add `MapStringSlice.FlattenJoin()`",
          "commit": "ced326e"
        }
      ],
      "changed": [
        {
          "description": "`type/maputil`: reorder functions in file",
          "commit": "bf5c98f"
        }
      ]
    },
    {
      "version": "v0.70.22",
      "date": "2025-09-13",
      "added": [
        {
          "description": "`text/markdown`: add `TableAlign()`",
          "commit": "171583e"
        },
        {
          "description": "`time/timeutil`: add `MustParseDT8Int()`, `ParseDT8Int()`",
          "commit": "1684411"
        }
      ],
      "changed": [
        {
          "description": "`time/timeutil`: update deps",
          "commit": "03c3ad9"
        },
        {
          "description": "`image/imageutil/cmd/webp2jpeg`: rename from `cli_webp2jpeg`",
          "commit": "1ff8598"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #180 from grokify/dependabot/go_modules/golang.org/x/crypto-0.42.0",
          "issue": "180",
          "commit": "93c4d91"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/crypto from 0.41.0 to 0.42.0",
          "commit": "d52603d"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "b01c00f"
        }
      ]
    },
    {
      "version": "v0.70.21",
      "date": "2025-09-07",
      "dependencies": [
        {
          "description": "Merge pull request #179 from grokify/dependabot/github_actions/actions/setup-go-6",
          "issue": "179",
          "commit": "b94b4bf"
        }
      ],
      "build": [
        {
          "description": "bump actions/setup-go from 5 to 6",
          "commit": "2653420"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "7a9ce78"
        }
      ]
    },
    {
      "version": "v0.70.20",
      "date": "2025-08-29",
      "added": [
        {
          "description": "`net/http/httpsimple`: add `Request.Bytes()`",
          "commit": "db3c5c8"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "4ad6644"
        }
      ]
    },
    {
      "version": "v0.70.19",
      "date": "2025-08-26",
      "changed": [
        {
          "description": "`codeql`: fix various",
          "commit": "3740147"
        },
        {
          "description": "`codeql`: fix various",
          "commit": "3061a48"
        },
        {
          "description": "`codeql`: fix various",
          "commit": "dbc115e"
        },
        {
          "description": "`imageutil`: update `WriteGIFFile()`",
          "commit": "0965232"
        }
      ],
      "fixed": [
        {
          "description": "`math/mathutil`: adjust to `int`",
          "commit": "67b1bb6"
        },
        {
          "description": "`mathutil`: update `MaxInt63`",
          "commit": "247613e"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "242ea8d"
        },
        {
          "description": "sast: add codeql",
          "commit": "66dc80d"
        }
      ]
    },
    {
      "version": "v0.70.18",
      "date": "2025-08-25",
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "e66e45a"
        },
        {
          "description": "`go mod`: update",
          "commit": "15c796e"
        },
        {
          "description": "`ci`: update go versions",
          "commit": "554fd56"
        }
      ]
    },
    {
      "version": "v0.70.17",
      "date": "2025-08-18",
      "added": [
        {
          "description": "`crypto/randutil`: add `NewMathRandCryptoSource()`",
          "commit": "ab2ee6c"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #178 from grokify/dependabot/github_actions/actions/checkout-5",
          "issue": "178",
          "commit": "87de3e1"
        },
        {
          "description": "Merge pull request #174 from grokify/dependabot/go_modules/golang.org/x/crypto-0.41.0",
          "issue": "174",
          "commit": "5fe5bcf"
        }
      ],
      "build": [
        {
          "description": "bump actions/checkout from 4 to 5",
          "commit": "e922ac6"
        },
        {
          "description": "bump golang.org/x/crypto from 0.40.0 to 0.41.0",
          "commit": "3009403"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "604778a"
        }
      ]
    },
    {
      "version": "v0.70.16",
      "date": "2025-08-04",
      "added": [
        {
          "description": "`text/stringcase`: add `Caser{}`, `CaserNoun{}`",
          "commit": "9dcaa4b"
        }
      ]
    },
    {
      "version": "v0.70.15",
      "date": "2025-08-03",
      "added": [
        {
          "description": "`database/sqlutil`: add `IsUnquotedIdentifier()`",
          "commit": "a329fe5"
        }
      ]
    },
    {
      "version": "v0.70.14",
      "date": "2025-08-03",
      "added": [
        {
          "description": "`database/schema`: add `SchemaCodegenEnt()`, `SchemaCodegenMySQL()`",
          "commit": "c0c6782"
        },
        {
          "description": "`database/sqlutil`: add `BuildSQLXInsertSQLNamedParams()`",
          "commit": "5c3965d"
        }
      ],
      "changed": [
        {
          "description": "`MarshalSlice`: add `stripBrackets` param",
          "commit": "9ef12bb"
        },
        {
          "description": "`database/sqlutil`: rename from `database/sql`",
          "commit": "7910702"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "1c9ab22"
        },
        {
          "description": "`database/examples`: update for `database/sqlutil` rename",
          "commit": "d9d7f97"
        }
      ]
    },
    {
      "version": "v0.70.13",
      "date": "2025-07-18",
      "changed": [
        {
          "description": "`net/http/httpsimple`: update `Request.Do()` and `Request.DoMore()` to support `*http.Client`",
          "commit": "5932be9"
        },
        {
          "description": "`encoding/jsonutil`: update `IndentBytes()` to avoid unmarshaling empty byte array",
          "commit": "9d705c7"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "d2467ed"
        }
      ]
    },
    {
      "version": "v0.70.12",
      "date": "2025-07-13",
      "added": [
        {
          "description": "`image/imageutil`: add `WriteGIFFile()` from `v0.70.7`",
          "commit": "d8dab27"
        }
      ],
      "changed": [
        {
          "description": "`image/imageutil`: add input validation for `WriteGIFFile()`",
          "commit": "cb7791e"
        },
        {
          "description": "`image/imageutil`: use golang style func names",
          "commit": "2fe5dee"
        }
      ]
    },
    {
      "version": "v0.70.11",
      "date": "2025-07-13",
      "added": [
        {
          "description": "`image/colors: add `IsNearWhite()`",
          "commit": "03365f8"
        },
        {
          "description": "`unicode/unicodeutil`: add `RemoveDiacritics()`",
          "commit": "10a1881"
        }
      ],
      "changed": [
        {
          "description": "`unicode/unicodeutil`: rename files",
          "commit": "328eb1f"
        },
        {
          "description": "`unicode/unicodeutil`: add test case",
          "commit": "81c3a22"
        },
        {
          "description": "`unicode/unicodeutil`: update `Unescape()`",
          "commit": "175a228"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #171 from grokify/dependabot/go_modules/golang.org/x/image-0.29.0",
          "issue": "171",
          "commit": "926f2ee"
        },
        {
          "description": "Merge pull request #170 from grokify/dependabot/go_modules/golang.org/x/text-0.27.0",
          "issue": "170",
          "commit": "579b549"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/image from 0.28.0 to 0.29.0",
          "commit": "9cf3f9f"
        },
        {
          "description": "bump golang.org/x/text from 0.26.0 to 0.27.0",
          "commit": "de471a3"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "9d26092"
        }
      ]
    },
    {
      "version": "v0.70.10",
      "date": "2025-06-23",
      "added": [
        {
          "description": "`crypto/randutil`: add `Int63()`",
          "commit": "9bfff2b"
        }
      ]
    },
    {
      "version": "v0.70.9",
      "date": "2025-06-22",
      "added": [
        {
          "description": "`time/cmd/dateadddays`: add `main()`",
          "commit": "f3b57e4"
        },
        {
          "description": "`image/imageutil`: add `Bleach()`, `GammaCorrect()`",
          "commit": "b72e0bc"
        },
        {
          "description": "`type/number`: add `Clamp255Float64()`, `Utoi()`",
          "commit": "ad47bbf"
        },
        {
          "description": "`image/colors`: add `GammaCorrectionColor()` to attempt to correct for webp constrast issue: https://github.com/golang/go/issues/40173",
          "commit": "8eb1ed3"
        },
        {
          "description": "`image/colors`: add `Black`, `White` colors",
          "commit": "a9dec54"
        }
      ],
      "changed": [
        {
          "description": "`image/imageutil`: use common error var `ErrImageNotSet`",
          "commit": "6e4cc38"
        }
      ],
      "internal": [
        {
          "description": "`golangci-lint`: fix various",
          "commit": "f72161f"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "ad81acc"
        },
        {
          "description": "`go mod`: update",
          "commit": "ce6385a"
        }
      ]
    },
    {
      "version": "v0.70.8",
      "date": "2025-06-15",
      "added": [
        {
          "description": "`image/imageutil.Image{}`: add `GIF()`, `GIFBytes()`, `Paletted()`, `WriteGIFFile()`",
          "commit": "cca3e67"
        }
      ],
      "changed": [
        {
          "description": "`image/imageutil`: update for consistency: `GIFBytes()`, `JPEGBytes()`, `PNGBytes()`",
          "commit": "4ca355f"
        }
      ]
    },
    {
      "version": "v0.70.7",
      "date": "2025-06-15",
      "added": [
        {
          "description": "`crypto/tlsutil`: add `CertManager{}`",
          "commit": "be7e38c"
        },
        {
          "description": "`crypto/x509util`: add `NewCertPoolWithFilepaths()`",
          "commit": "573e5f1"
        },
        {
          "description": "`image/imageutil`: add `Image.SplitHorz()`",
          "commit": "b5ef2e3"
        }
      ],
      "changed": [
        {
          "description": "`image/imageutil`: update units to `int`",
          "commit": "275a2cf"
        }
      ],
      "internal": [
        {
          "description": "`golangci-lint`: fix various",
          "commit": "aaeab83"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "e4dc5dc"
        },
        {
          "description": "`image/imageutil`: update internal style and docs",
          "commit": "d9894ad"
        }
      ]
    },
    {
      "version": "v0.70.6",
      "date": "2025-06-09",
      "added": [
        {
          "description": "`crypto/randutil`: add `Intn()`",
          "commit": "3d2e423"
        },
        {
          "description": "`type/stringsutil`: add `Strings.IndexEqualFoldFull()`",
          "commit": "1fd7c34"
        }
      ]
    },
    {
      "version": "v0.70.5",
      "date": "2025-06-08",
      "added": [
        {
          "description": "`type/number`: add `Integers.MinMax()`, and refactor",
          "commit": "61aeb30"
        }
      ]
    },
    {
      "version": "v0.70.4",
      "date": "2025-06-07",
      "added": [
        {
          "description": "`fmt/fmtutil`: add `FprintIf()`, `FprintfIf()`",
          "commit": "1ccef80"
        }
      ],
      "changed": [
        {
          "description": "`fmt/fmtutil`: add `if_test.go`",
          "commit": "4de280b"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #169 from grokify/dependabot/go_modules/golang.org/x/net-0.41.0",
          "issue": "169",
          "commit": "4a6603f"
        },
        {
          "description": "Merge pull request #168 from grokify/dependabot/go_modules/golang.org/x/image-0.28.0",
          "issue": "168",
          "commit": "6436778"
        },
        {
          "description": "Merge pull request #167 from grokify/dependabot/go_modules/golang.org/x/crypto-0.39.0",
          "issue": "167",
          "commit": "ecb5ca7"
        },
        {
          "description": "Merge pull request #166 from grokify/dependabot/go_modules/golang.org/x/text-0.26.0",
          "issue": "166",
          "commit": "fd21e61"
        }
      ],
      "documentation": [
        {
          "description": "`README.md`: update shields",
          "commit": "2c948ad"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/net from 0.40.0 to 0.41.0",
          "commit": "bfd60ca"
        },
        {
          "description": "bump golang.org/x/image from 0.27.0 to 0.28.0",
          "commit": "4b941bd"
        },
        {
          "description": "bump golang.org/x/crypto from 0.38.0 to 0.39.0",
          "commit": "153237d"
        },
        {
          "description": "bump golang.org/x/text from 0.25.0 to 0.26.0",
          "commit": "3a7b6d9"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "c6df62d"
        }
      ]
    },
    {
      "version": "v0.70.3",
      "date": "2025-06-02",
      "changed": [
        {
          "description": "`mime/multipart`: adjust filenames and func names",
          "commit": "e0970a0"
        }
      ]
    },
    {
      "version": "v0.70.2",
      "date": "2025-06-01",
      "changed": [
        {
          "description": "`mime/multipartutil`: rename `MultipartBuilder.ContentTypeHeader()` for consistency and clarity",
          "commit": "336cc24"
        },
        {
          "description": "`mime/multipartutil`: improve error handling for `MultipartBuilder.ContentType()`, `Part.ContentDispositionHeader()`",
          "commit": "d2cf16b"
        },
        {
          "description": "`net/http/httputilmore`: rename `DispositionType` constants",
          "commit": "21ba10f"
        }
      ]
    },
    {
      "version": "v0.70.1",
      "date": "2025-06-01",
      "added": [
        {
          "description": "`type/maputil`: add `MapStringFloat32{}`",
          "commit": "c29eba3"
        },
        {
          "description": "`type/maputil.MapStringInt`: add `String()`",
          "commit": "923ae42"
        },
        {
          "description": "`type/maputil.MapCompInt{}`: add `Percentages()`, `PercentagesInt()`",
          "commit": "e9057d8"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "229e44f"
        }
      ]
    },
    {
      "version": "v0.70.0",
      "date": "2025-05-26",
      "added": [
        {
          "description": "`type/maputil`: add `MapCompComp{}`, `.Equal()`, `.FilterMergeByMap()`, `.ValueKeyCounts()`",
          "commit": "664d0d1"
        },
        {
          "description": "`type/maputil`: add `MapStringString.ReverseMapStringSlice()`",
          "commit": "71821e9"
        }
      ],
      "changed": [
        {
          "description": "`type/maputil`: rename `MapCompInt{}` from `MapComparableInt{}`",
          "commit": "ed088b2"
        },
        {
          "description": "`time/timeutil`: simplify `IsDTX()` to use `int` vs. `int32`",
          "commit": "9de5002"
        }
      ],
      "internal": [
        {
          "description": "`golangci-lint`: fix various",
          "commit": "4115e02"
        },
        {
          "description": "`go mod`: update",
          "commit": "80b3961"
        }
      ]
    },
    {
      "version": "v0.69.3",
      "date": "2025-05-12",
      "added": [
        {
          "description": "`type/number`: add constraints `Integer`, `Signed`, `Unsigned`",
          "commit": "07fa1b0"
        },
        {
          "description": "`crypto/randutil`: add `CryptoRandIntInRange()`",
          "commit": "e2c53ea"
        },
        {
          "description": "`type/nubmber`: add `U64toi64()`",
          "commit": "f4fe12a"
        },
        {
          "description": "`type/number`: add `Itou16()`",
          "commit": "426b211"
        },
        {
          "description": "`strconv/strconvutil`: add `Atou16()`",
          "commit": "30141db"
        },
        {
          "description": "`image/exif`: initial commit for `Exif{}`",
          "commit": "2041224"
        }
      ],
      "changed": [
        {
          "description": "`crypto/randutil`: move to `crypto/rand`",
          "commit": "4b5b203"
        },
        {
          "description": "`image/imageutil`: `gofmt`",
          "commit": "2e668b5"
        },
        {
          "description": "`image/imageutil`: move `SOIFilterWriter{}` to own file",
          "commit": "ee9c865"
        },
        {
          "description": "`image/exif`: remove `exif_test` package",
          "commit": "f251619"
        }
      ],
      "documentation": [
        {
          "description": "`README.md`: add lint shield",
          "commit": "0ef2b2f"
        }
      ],
      "internal": [
        {
          "description": "`strconv/phonenumber`: fix various",
          "commit": "bea9be5"
        },
        {
          "description": "`crypto/randutil`: fix various",
          "commit": "25c765d"
        },
        {
          "description": "`image/exif`: fix various",
          "commit": "46856f6"
        }
      ]
    },
    {
      "version": "v0.69.2",
      "date": "2025-05-11",
      "added": [
        {
          "description": "`image/imageutil`: add `EncodeJPEGWithExif()`, `SOIFilterWriter{}`",
          "commit": "02bd953"
        }
      ],
      "changed": [
        {
          "description": "`image/colors`: update style",
          "commit": "01e8f10"
        }
      ],
      "internal": [
        {
          "description": "`golangci-lint`: fix various",
          "commit": "bb63d17"
        }
      ]
    },
    {
      "version": "v0.69.1",
      "date": "2025-05-11",
      "changed": [
        {
          "description": "`time`: update args to use `int`",
          "commit": "1c83017"
        }
      ]
    },
    {
      "version": "v0.69.0",
      "date": "2025-05-11",
      "added": [
        {
          "description": "`time/timeutil`: add `AddMonths()`",
          "commit": "c9d453b"
        },
        {
          "description": "`type/ordered`: add `MinMax()`",
          "commit": "470444f"
        },
        {
          "description": "`type/slicesutil`: add `Venn2ResultStats{}`, `Venn2ResultOrdered.Venn2ResultStats()`",
          "commit": "b4315ab"
        },
        {
          "description": "`strconv/strconvutil`: add `Atou32()`",
          "commit": "cacb659"
        }
      ],
      "changed": [
        {
          "description": "`golangci-lint`: fix various",
          "commit": "8187a53"
        },
        {
          "description": "`time/timeutil`: refactor to fix lint findings",
          "commit": "239ab38"
        }
      ],
      "internal": [
        {
          "description": "`crypto/tlsutil`: fix various",
          "commit": "640e6a9"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "aed79ac"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "c425d59"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "e57789f"
        }
      ]
    },
    {
      "version": "v0.68.18",
      "date": "2025-05-08",
      "fixed": [
        {
          "description": "`type/slicesutil`: add `sort()` for `Venn2Sort()`",
          "commit": "1e36cf4"
        }
      ]
    },
    {
      "version": "v0.68.17",
      "date": "2025-05-08",
      "changed": [
        {
          "description": "`math/mathutil`: favor `Divide()` over `DivideInt64()`",
          "commit": "cf08fcd"
        }
      ],
      "internal": [
        {
          "description": "`time/quarter`: update to `uint32`",
          "commit": "9fb1611"
        }
      ]
    },
    {
      "version": "v0.68.16",
      "date": "2025-05-08",
      "added": [
        {
          "description": "`regexp/regexputil`: fix various",
          "commit": "77f7727"
        },
        {
          "description": "`type/number`: add `Itou()`, `Itous()`, `Itoi32s()`",
          "commit": "82e5c0e"
        },
        {
          "description": "`math/mathutil`: add `Divide()`",
          "commit": "9b6b231"
        }
      ],
      "changed": [
        {
          "description": "`type/slicesutil`: add `Venn2ResultOrdered.Union`",
          "commit": "21672c3"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #164 from grokify/dependabot/go_modules/golang.org/x/net-0.40.0",
          "issue": "164",
          "commit": "bf85e43"
        },
        {
          "description": "Merge pull request #160 from grokify/dependabot/github_actions/golangci/golangci-lint-action-8",
          "issue": "160",
          "commit": "68b4b0c"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/net from 0.39.0 to 0.40.0",
          "commit": "78a7c8d"
        },
        {
          "description": "bump golangci/golangci-lint-action from 7 to 8",
          "commit": "c7f3e92"
        }
      ],
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "5075c35"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "2fc39de"
        }
      ]
    },
    {
      "version": "v0.68.15",
      "date": "2025-05-03",
      "added": [
        {
          "description": "`type/slicesutil`: add `ElementCountsReverse()`",
          "commit": "80ee9f3"
        }
      ]
    },
    {
      "version": "v0.68.14",
      "date": "2025-05-03",
      "internal": [
        {
          "description": "`go mod`: update",
          "commit": "28220c7"
        }
      ]
    },
    {
      "version": "v0.68.13",
      "date": "2025-04-28",
      "added": [
        {
          "description": "`type/number`: add `IntToUint32()`",
          "commit": "89ea99c"
        },
        {
          "description": "`type/number`: add `IntToUint32()`",
          "commit": "03697b3"
        }
      ],
      "changed": [
        {
          "description": "`type/number`: improve error messaging",
          "commit": "4a57d20"
        },
        {
          "description": "`type/nubmer`: rename `Ito(i8|i16|i32|u32`",
          "commit": "d04b100"
        },
        {
          "description": "`type/number`: rename `Uint32()` from `IntToUint32()`",
          "commit": "8e73177"
        }
      ]
    },
    {
      "version": "v0.68.12",
      "date": "2025-04-27",
      "added": [
        {
          "description": "`encoding/jsonutil/jsonraw`: add `Clone()`",
          "commit": "b9f7283"
        }
      ],
      "changed": [
        {
          "description": "`type/maputil`: simplify code",
          "commit": "033fb8e"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "7f5a81a"
        }
      ]
    },
    {
      "version": "v0.68.11",
      "date": "2025-04-22",
      "added": [
        {
          "description": "`type/maputil`: add `MapStringAnys{}`",
          "commit": "6334896"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "de37619"
        }
      ]
    },
    {
      "version": "v0.68.10",
      "date": "2025-04-21",
      "added": [
        {
          "description": "`crypto/randutil`: add `Float64()`, `MustFloat64()`",
          "commit": "23b3746"
        }
      ]
    },
    {
      "version": "v0.68.9",
      "date": "2025-04-20",
      "added": [
        {
          "description": "`strconv/strconvutil`: add `ParseUint8()`",
          "commit": "838f697"
        },
        {
          "description": "`type/slicesutil`: add `SplitVennResultComparable{}`, `SplitVennResultOrdered{}`",
          "commit": "9cf004e"
        }
      ],
      "internal": [
        {
          "description": "`golangci-lint`: fix various",
          "commit": "f8114a8"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "0ad9650"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "55a3baf"
        }
      ]
    },
    {
      "version": "v0.68.8",
      "date": "2025-04-19",
      "added": [
        {
          "description": "`type/number`: add `Ntof64()`",
          "commit": "fd6d908"
        },
        {
          "description": "`type/number`: add `Integers{}`, `IntegersMatrix{}`",
          "commit": "e98331c"
        },
        {
          "description": "`fmt/fmtutil`: add `MustPrintJSONReader()`, `PrintJSONReader()`",
          "commit": "0f33c26"
        }
      ],
      "changed": [
        {
          "description": "chore(lint); `golangci-lint`: update rules",
          "commit": "accdf2e"
        },
        {
          "description": "`examples`: move items from top level directory",
          "commit": "ac449f5"
        },
        {
          "description": "`net/http/httpsimple`: add `context.Context` support to `Client{}`",
          "commit": "aa6926d"
        }
      ],
      "internal": [
        {
          "description": "`golangci-lint`: fix various",
          "commit": "a9a8a54"
        },
        {
          "description": "go mod: update",
          "commit": "5f4b302"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "04cc4ac"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "a998d9c"
        },
        {
          "description": "`golangci-lint`: fix various",
          "commit": "ceea104"
        }
      ]
    },
    {
      "version": "v0.68.7",
      "date": "2025-04-12",
      "added": [
        {
          "description": "`type/slicesutil`: add `MatchAny()`, `SplitVenn2()`, `SplitVenn2Sort()`",
          "commit": "32b4b1f"
        },
        {
          "description": "`type/strslices`: add `MatchAny()`, `Map()`, `ToLower()`, `ToUpper()`",
          "commit": "4a693d1"
        }
      ],
      "changed": [
        {
          "description": "`type/strslices`: copy from `type/stringsutil`",
          "commit": "75ea42f"
        },
        {
          "description": "`type/stringsutil`: add `TestSplitTrimSpace()`",
          "commit": "fa9be77"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "19648a1"
        }
      ]
    },
    {
      "version": "v0.68.6",
      "date": "2025-04-08",
      "added": [
        {
          "description": "`type/strslices`: add `Contains()`",
          "commit": "6b909f4"
        }
      ],
      "changed": [
        {
          "description": "`type/strslices`: move some from `type/stringsutil`",
          "commit": "684c43d"
        }
      ],
      "dependencies": [
        {
          "description": "Merge pull request #159 from grokify/dependabot/go_modules/golang.org/x/net-0.39.0",
          "issue": "159",
          "commit": "5e1f6e4"
        }
      ],
      "build": [
        {
          "description": "bump golang.org/x/net from 0.38.0 to 0.39.0",
          "commit": "d62ed9c"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "23b3a28"
        }
      ]
    },
    {
      "version": "v0.68.5",
      "date": "2025-04-06",
      "added": [
        {
          "description": "`type/maputil`: add `MapComparableInt{}`",
          "commit": "9ab76b2"
        }
      ],
      "internal": [
        {
          "description": "go mod: update",
          "commit": "8a6e669"
        }
      ]
    },
    {
      "version": "v0.68.4",
      "date": "2025-03-30",
      "added": [
        {
          "description": "`type/maputil`: add `MapStringAny.MustValueString()`",
          "commit": "6549465"
        },
        {
          "description": "`strconv/strconvutil`: add `AnyToString()`",
          "commit": "782ed0a"
        }
      ],
      "dependencies": [
        {
